MikroElektronika/core_packages/ARM/gcc_clang/def/mindmotion/MM32F103CCT/mcu.h
    SDIO_IRQn                   = 49,     /*   SDIO              */
    TIM5_IRQn                   = 50,     /*   TIM5              */
    SPI3_IRQn                   = 51,     /*   SPI3              */
    UART4_IRQn                  = 52,     /*   UART4             */
    UART5_IRQn                  = 53,     /*   UART5             */
    TIM6_IRQn                   = 54,     /*   TIM6              */
    TIM7_IRQn                   = 55,     /*   TIM7              */
    DMA2_Channel1_IRQn          = 56,     /*   DMA2 Channel 1    */
    DMA2_Channel2_IRQn          = 57,     /*   DMA2 Channel 2    */
    DMA2_Channel3_IRQn          = 58,     /*   DMA2 Channel 3    */
    DMA2_Channel4_IRQn          = 59,     /*   DMA2 Channel 4    */
    DMA2_Channel5_IRQn          = 60,     /*   DMA2 Channel 5    */
    ETHERNET_MAC_IRQn           = 61,     /*   Ethernet          */


    COMP1_2_IRQn                = 64,     /*   COMP1,COMP2       */


    USB_OTG_FS_IRQn             = 67,     /*   USB_FS            */


    UART6_IRQn                  = 71,     /*   UART6             */







    AES_IRQn                    = 79,     /*   AES               */
    TRNG_IRQn                   = 80,     /*   TRNG              */

    UART7_IRQn                  = 82,     /*   UART7             */
    UART8_IRQn                  = 83,     /*   UART8             */

} IRQn_Type;




/**
* @}
*/

#include <core_cm3.h>

#include <stdint.h>

/** @addtogroup Exported_types
* @{
*/

/*!< MM32F103xCxE_o Standard Peripheral Library old types (maintained for legacy prupose) */
typedef int32_t s32;
typedef int16_t s16;
typedef int8_t  s8;

typedef const int32_t sc32;  /*!< Read Only */
typedef const int16_t sc16;  /*!< Read Only */
typedef const int8_t  sc8;   /*!< Read Only */

typedef __IO int32_t  vs32;
typedef __IO int16_t  vs16;
typedef __IO int8_t   vs8;

typedef __I int32_t vsc32;  /*!< Read Only */
typedef __I int16_t vsc16;  /*!< Read Only */
typedef __I int8_t  vsc8;   /*!< Read Only */

typedef uint32_t u32;
typedef uint16_t u16;
typedef uint8_t  u8;

typedef const uint32_t uc32;  /*!< Read Only */
typedef const uint16_t uc16;  /*!< Read Only */
typedef const uint8_t  uc8;   /*!< Read Only */

typedef __IO uint32_t vu32;
typedef __IO uint16_t vu16;
typedef __IO uint8_t  vu8;

typedef __I uint32_t vuc32;  /*!< Read Only */
typedef __I uint16_t vuc16;  /*!< Read Only */
typedef __I uint8_t  vuc8;   /*!< Read Only */

typedef enum {FALSE = 0, TRUE = !FALSE} bool;

typedef enum {RESET = 0, SET = !RESET} FlagStatus, ITStatus;

typedef enum {DISABLE = 0, ENABLE = !DISABLE} FunctionalState;
#define IS_FUNCTIONAL_STATE(STATE) (((STATE) == DISABLE) || ((STATE) == ENABLE))

typedef enum {ERROR = 0, SUCCESS = !ERROR} ErrorStatus;

#define SETnBIT(VALUE,BITs)   ((VALUE) |= (1<<BITs))
#define RSTnBIT(VALUE,BITs)   ((VALUE) &= ~(1<<BITs))


/**
* @}
*/

typedef struct {
    __IO uint32_t     SHCSR;  //0XE000DE24
    __IO uint8_t      MFSR;   //0XE000DE28
    __IO uint8_t      BFSR;   //0XE000DE29
    __IO uint16_t     UFSR;   //0XE000DE2A
    __IO uint32_t     HFSR;   //0XE000DE2C
    __IO uint32_t     DFSR;   //0XE000DE30
    __IO uint32_t     MMAR;   //0XE000DE34
    __IO uint32_t     BFAR;   //0XE000DE38
} HARD_FAULT_TypeDef;


/** @addtogroup Peripheral_registers_structures
* @{
*/

/**
* @brief Analog to Digital Converter
*/

typedef struct {
    __IO uint32_t ADDATA;
    __IO uint32_t ADCFG;
    __IO uint32_t ADCR;
    __IO uint32_t ADCHS;
    __IO uint32_t ADCMPR;
    __IO uint32_t ADSTA;
    __IO uint32_t ADDR0;
    __IO uint32_t ADDR1;
    __IO uint32_t ADDR2;
    __IO uint32_t ADDR3;
    __IO uint32_t ADDR4;
    __IO uint32_t ADDR5;
    __IO uint32_t ADDR6;
    __IO uint32_t ADDR7;
    __IO uint32_t ADDR8;
    // __IO uint32_t ADDR9;
    // __IO uint32_t ADDR10;
    // __IO uint32_t ADDR11;
    // __IO uint32_t ADDR12;
    // __IO uint32_t ADDR13;
    // __IO uint32_t ADDR14;
    // __IO uint32_t ADDR15;
} ADC_TypeDef;

/**
* @brief Backup Registers
*/

typedef struct {
    __IO uint32_t RESERVED0;//0x24
    __IO uint16_t DR1;//0x28
    __IO uint16_t RESERVED1;
    __IO uint16_t DR2;
    __IO uint16_t RESERVED2;
    __IO uint16_t DR3;
    __IO uint16_t RESERVED3;
    __IO uint16_t DR4;
    __IO uint16_t RESERVED4;
    __IO uint16_t DR5;
    __IO uint16_t RESERVED5;
    __IO uint16_t DR6;
    __IO uint16_t RESERVED6;
    __IO uint16_t DR7;
    __IO uint16_t RESERVED7;
    __IO uint16_t DR8;
    __IO uint16_t RESERVED8;
    __IO uint16_t DR9;
    __IO uint16_t RESERVED9;
    __IO uint16_t DR10;
    __IO uint16_t RESERVED10;
    __IO uint16_t RTCCR;
    __IO uint16_t RESERVED11;
    __IO uint16_t CR;
    __IO uint16_t RESERVED12;
    __IO uint16_t CSR;
    __IO uint16_t RESERVED13;
    __IO uint16_t DR11;
    __IO uint16_t RESERVED14;
    __IO uint16_t DR12;
    __IO uint16_t RESERVED15;
    __IO uint16_t DR13;
    __IO uint16_t RESERVED16;
    __IO uint16_t DR14;
    __IO uint16_t RESERVED17;
    __IO uint16_t DR15;
    __IO uint16_t RESERVED18;
    __IO uint16_t DR16;
    __IO uint16_t RESERVED19;
    __IO uint16_t DR17;
    __IO uint16_t RESERVED20;
    __IO uint16_t DR18;
    __IO uint16_t RESERVED21;
    __IO uint16_t DR19;
    __IO uint16_t RESERVED22;
    __IO uint16_t DR20;
    __IO uint16_t RESERVED23;

} BKP_TypeDef;

/**
* @brief CAN basic
*/
typedef struct {
    __IO uint32_t CR;             //0x00
    __IO uint32_t CMR;            //0x04
    __IO uint32_t SR;             //0x08
    __IO uint32_t IR;             //0x0c
    __IO uint32_t ACR;            //0x10
    __IO uint32_t AMR;            //0x14
    __IO uint32_t BTR0;           //0x18
    __IO uint32_t BTR1;           //0x1C
    __IO uint32_t RESERVED0;  //0x20
    __IO uint32_t RESERVED1;  //0x24
    __IO uint32_t TXID0;        //0x28
    __IO uint32_t TXID1;        //0x2c
    __IO uint32_t TXDR0;        //0x30
    __IO uint32_t TXDR1;        //0x34
    __IO uint32_t TXDR2;        //0x38
    __IO uint32_t TXDR3;        //0x3c
    __IO uint32_t TXDR4;        //0x40
    __IO uint32_t TXDR5;        //0x44
    __IO uint32_t TXDR6;        //0x48
    __IO uint32_t TXDR7;        //0x4c
    __IO uint32_t RXID0;        //0x50
    __IO uint32_t RXID1;        //0x54
    __IO uint32_t RXDR0;        //0x58
    __IO uint32_t RXDR1;        //0x5C
    __IO uint32_t RXDR2;        //0x60
    __IO uint32_t RXDR3;      //0x64
    __IO uint32_t RXDR4;      //0x68
    __IO uint32_t RXDR5;        //0x6c
    __IO uint32_t RXDR6;        //0x70
    __IO uint32_t RXDR7;        //0x74
    __IO uint32_t RESERVED2;  //0x78
    __IO uint32_t CDR;            //0x7c
} CAN_TypeDef;

/**
* @brief CAN Peli
*/
#define ACR0 FF
#define ACR1 ID0
#define ACR2 ID1
#define ACR3 DATA0
#define AMR0 DATA1
#define AMR1 DATA2
#define AMR2 DATA3
#define AMR3 DATA4
typedef struct {
    __IO uint32_t MOD;        //0x00
    __IO uint32_t CMR;        //0x04
    __IO uint32_t SR;         //0x08
    __IO uint32_t IR;         //0x0c
    __IO uint32_t IER;            //0x10
    __IO uint32_t RESERVED0;  //0x14
    __IO uint32_t BTR0;       //0x18
    __IO uint32_t BTR1;       //0x1C
    __IO uint32_t RESERVED1;  //0x20
    __IO uint32_t RESERVED2;  //0x24
    __IO uint32_t RESERVED3;  //0x28
    __IO uint32_t ALC;        //0x2c
    __IO uint32_t ECC;            //0x30
    __IO uint32_t EWLR;       //0x34
    __IO uint32_t RXERR;      //0x38
    __IO uint32_t TXERR;      //0x3c
    __IO uint32_t FF;             //0x40
    __IO uint32_t ID0;        //0x44
    __IO uint32_t ID1;        //0x48
    __IO uint32_t DATA0;      //0x4c
    __IO uint32_t DATA1;      //0x50
    __IO uint32_t DATA2;      //0x54
    __IO uint32_t DATA3;      //0x58
    __IO uint32_t DATA4;      //0x5C
    __IO uint32_t DATA5;      //0x60
    __IO uint32_t DATA6;      //0x64
    __IO uint32_t DATA7;      //0x68
    __IO uint32_t DATA8;      //0x6c
    __IO uint32_t DATA9;      //0x70
    __IO uint32_t RMC;
    __IO uint32_t RBSA;
    __IO uint32_t CDR;        //0x7c
} CAN_Peli_TypeDef;


/**
* @}
*/

