MikroElektronika/core_packages/ARM/gcc_clang/def/mindmotion/MM32F103CCT/mcu.h
typedef struct {
    __IO uint32_t     CCR;
    __IO uint32_t     SR;
    __IO uint32_t     IRQMASKR;
    __IO uint32_t     IRQSTATR;
    __IO uint32_t     RESERVED0;
    __IO uint32_t     CSHR;
    __IO uint32_t     CSMR;
} CACHE_TypeDef;

/**
* @brief COMP
*/

typedef struct {
    __IO uint32_t COMP_CSR1;
    __IO uint32_t COMP_CSR2;
} COMP_TypeDef;


/**
* @brief CRC calculation unit
*/
typedef struct {
    __IO uint32_t DR;
    __IO uint16_t IDR;
    __IO uint16_t RESERVED0;
    __IO uint32_t CR;
} CRC_TypeDef;

typedef struct {
    __IO uint32_t CR;
    __IO uint32_t CFGR;
    __IO uint32_t ISR;
    __IO uint32_t ICR;
} CRS_TypeDef;


/**
* @brief Debug MCU
*/

typedef struct {
    __IO uint32_t IDCODE;
    __IO uint32_t CR;
} DBGMCU_TypeDef;

/**
* @brief DMA Controller
*/

typedef struct {
    __IO uint32_t CCR;
    __IO uint32_t CNDTR;
    __IO uint32_t CPAR;
    __IO uint32_t CMAR;
} DMA_Channel_TypeDef;

typedef struct {
    __IO uint32_t ISR;
    __IO uint32_t IFCR;
} DMA_TypeDef;

/**
* @brief External Interrupt/Event Controller
*/

typedef struct {
    __IO uint32_t IMR;
    __IO uint32_t EMR;
    __IO uint32_t RTSR;
    __IO uint32_t FTSR;
    __IO uint32_t SWIER;
    __IO uint32_t PR;
} EXTI_TypeDef;

/**
* @brief FLASH Registers
*/
typedef struct {
    __IO uint32_t ACR;
    __IO uint32_t KEYR;
    __IO uint32_t OPTKEYR;
    __IO uint32_t SR;
    __IO uint32_t CR;
    __IO uint32_t AR;
    __IO uint32_t RESERVED;
    __IO uint32_t OBR;
    __IO uint32_t WRP0R;
    __IO uint32_t WRP1R;
    __IO uint32_t WRP2R;
    __IO uint32_t WRP3R;
    __IO uint32_t RESERVED0;
    __IO uint32_t RESERVED1;
    __IO uint32_t RESERVED2;
    __IO uint32_t RESERVED3;
    __IO uint32_t SECUKEY0R;
    __IO uint32_t SECUKEY1R;
    // __IO uint32_t RESERVED4;
    // __IO uint32_t RESERVED5;
    // __IO uint32_t EEPKEYR;
} FLASH_TypeDef;

/**
* @brief Option Bytes Registers
*/

typedef struct {
    __IO uint16_t RDP;
    __IO uint16_t USER;
    __IO uint16_t Data0;
    __IO uint16_t Data1;
    __IO uint16_t WRP0;
    __IO uint16_t WRP1;
    __IO uint16_t WRP2;
    __IO uint16_t WRP3;
} OB_TypeDef;



/**
* @brief General Purpose IO
*/

typedef struct {
    __IO uint32_t CRL;
    __IO uint32_t CRH;
    __IO uint32_t IDR;
    __IO uint32_t ODR;
    __IO uint32_t BSRR;
    __IO uint32_t BRR;
    __IO uint32_t LCKR;
    __IO uint32_t RESERVED0;
    __IO uint32_t AFRL;
    __IO uint32_t AFRH;
} GPIO_TypeDef;

/**
* @brief SysTem Configuration
*/

typedef struct {
    __IO uint32_t CFGR;       /*!< SYSCFG configuration register ,                           Address offset: 0x00 */
    __IO uint32_t RESERVED0;
    __IO uint32_t EXTICR[4];

} SYSCFG_TypeDef;


/**
* @brief Inter-integrated Circuit Interface
*/

typedef struct {
    __IO uint16_t IC_CON;
    __IO uint16_t RESERVED0;
    __IO uint16_t IC_TAR;
    __IO uint16_t RESERVED1;
    __IO uint16_t IC_SAR;
    __IO uint16_t RESERVED2;
    // __IO uint16_t IC_HS_MADDR;
    __IO uint32_t RESERVED3;
    __IO uint16_t IC_DATA_CMD;
    __IO uint16_t RESERVED4;
    __IO uint16_t IC_SS_SCL_HCNT;
    __IO uint16_t RESERVED5;
    __IO uint16_t IC_SS_SCL_LCNT;
    __IO uint16_t RESERVED6;
    __IO uint16_t IC_FS_SCL_HCNT;
    __IO uint16_t RESERVED7;
    __IO uint16_t IC_FS_SCL_LCNT;
    __IO uint16_t RESERVED8;
    // __IO uint16_t IC_HS_SCL_HCNT;
    __IO uint32_t RESERVED9;
    // __IO uint16_t IC_HS_SCL_LCNT;
    __IO uint32_t RESERVED10;
    __IO uint16_t IC_INTR_STAT;
    __IO uint16_t RESERVED11;
    __IO uint16_t IC_INTR_MASK;
    __IO uint16_t RESERVED12;
    __IO uint16_t IC_RAW_INTR_STAT;
    __IO uint16_t RESERVED13;
    __IO uint16_t IC_RX_TL;
    __IO uint16_t RESERVED14;
    __IO uint16_t IC_TX_TL;
    __IO uint16_t RESERVED15;
    __IO uint16_t IC_CLR_INTR;
    __IO uint16_t RESERVED16;
    __IO uint16_t IC_CLR_RX_UNDER;
    __IO uint16_t RESERVED17;
    __IO uint16_t IC_CLR_RX_OVER;
    __IO uint16_t RESERVED18;
    __IO uint16_t IC_CLR_TX_OVER;
    __IO uint16_t RESERVED19;
    __IO uint16_t IC_CLR_RD_REQ;
    __IO uint16_t RESERVED20;
    __IO uint16_t IC_CLR_TX_ABRT;
    __IO uint16_t RESERVED21;
    __IO uint16_t IC_CLR_RX_DONE;
    __IO uint16_t RESERVED22;
    __IO uint16_t IC_CLR_ACTIVITY;
    __IO uint16_t RESERVED23;
    __IO uint16_t IC_CLR_STOP_DET;
    __IO uint16_t RESERVED24;
    __IO uint16_t IC_CLR_START_DET;
    __IO uint16_t RESERVED25;
    __IO uint16_t IC_CLR_GEN_CALL;
    __IO uint16_t RESERVED26;
    __IO uint16_t IC_ENABLE;
    __IO uint16_t RESERVED27;
    __IO uint16_t IC_STATUS;
    __IO uint16_t RESERVED28;
    __IO uint16_t IC_TXFLR;
    __IO uint16_t RESERVED29;
    __IO uint16_t IC_RXFLR;
    __IO uint16_t RESERVED30;
    __IO uint16_t IC_SDA_HOLD;
    __IO uint16_t RESERVED31;
    __IO uint32_t RESERVED32;
    __IO uint32_t RESERVED33;
    __IO uint16_t IC_DMA_CR;
    __IO uint16_t RESERVED34;
    __IO uint32_t RESERVED35;
    __IO uint32_t RESERVED36;
    // __IO uint16_t IC_DMA_TDLR;
    // __IO uint16_t IC_DMA_RDLR;
    __IO uint16_t IC_SDA_SETUP;
    __IO uint16_t RESERVED37;
    __IO uint16_t IC_ACK_GENERAL_CALL;
    __IO uint16_t RESERVED38;

    // __IO uint32_t IC_FS_SPKLEN;
    // __IO uint32_t IC_HS_SPKLEN;

    // __IO uint16_t IC_CLR_RESTART_DET;
    // __IO uint16_t RESERVED28;
    // __IO uint32_t IC_COMP_PARAM_1;
    // __IO uint32_t IC_COMP_VERSION;
    // __IO uint32_t IC_COMP_TYPE;
} I2C_TypeDef;

/**
* @brief Independent WATCHDOG
*/

typedef struct {
    __IO uint32_t KR;
    __IO uint32_t PR;
    __IO uint32_t RLR;
    __IO uint32_t SR;
    __IO uint32_t CTRL;
} IWDG_TypeDef;

/**
* @brief Power Control
*/

typedef struct {
    __IO uint32_t CR;
    __IO uint32_t CSR;
} PWR_TypeDef;

/**
* @brief Reset and Clock Control
*/

typedef struct {
    __IO uint32_t CR;
    __IO uint32_t CFGR;
    __IO uint32_t CIR;
    __IO uint32_t AHB3RSTR;
    __IO uint32_t AHB2RSTR;
    __IO uint32_t AHB1RSTR;
    __IO uint32_t APB2RSTR;
    __IO uint32_t APB1RSTR;
    __IO uint32_t AHB3ENR;
    __IO uint32_t AHB2ENR;
    __IO uint32_t AHB1ENR;
    __IO uint32_t APB2ENR;
    __IO uint32_t APB1ENR;
    __IO uint32_t BDCR;
    __IO uint32_t CSR;
    __IO uint32_t SYSCFGR;
} RCC_TypeDef;

/**
* @brief Real-Time Clock
*/

