MikroElektronika/core_packages/ARM/gcc_clang/def/mindmotion/MM32F103CCT/mcu.h
typedef struct {
    __IO uint16_t CRH;
    __IO uint16_t RESERVED0;
    __IO uint16_t CRL;
    __IO uint16_t RESERVED1;
    __IO uint16_t PRLH;
    __IO uint16_t RESERVED2;
    __IO uint16_t PRLL;
    __IO uint16_t RESERVED3;
    __IO uint16_t DIVH;
    __IO uint16_t RESERVED4;
    __IO uint16_t DIVL;
    __IO uint16_t RESERVED5;
    __IO uint16_t CNTH;
    __IO uint16_t RESERVED6;
    __IO uint16_t CNTL;
    __IO uint16_t RESERVED7;
    __IO uint16_t ALRH;
    __IO uint16_t RESERVED8;
    __IO uint16_t ALRL;
    __IO uint16_t RESERVED9;
} RTC_TypeDef;


/**
* @brief Serial Peripheral Interface
*/

#define NSSR    SCSR
#define EXTCTL  EXTSCR
typedef struct {
    __IO uint32_t TXREG;      //0
    __IO uint32_t RXREG;      //4
    __IO uint16_t CSTAT;      //8
    __IO uint16_t RESERVED0;
    __IO uint16_t INTSTAT;    //c
    __IO uint16_t RESERVED1;
    __IO uint16_t INTEN;      //10
    __IO uint16_t RESERVED2;
    __IO uint16_t INTCLR;     //14
    __IO uint16_t RESERVED3;
    __IO uint16_t GCTL;       //18
    __IO uint16_t RESERVED4;
    __IO uint16_t CCTL;       //1c
    __IO uint16_t RESERVED5;
    __IO uint16_t SPBRG;      //20
    __IO uint16_t RESERVED6;
    __IO uint16_t RXDNR;      //24
    __IO uint16_t RESERVED7;
    __IO uint16_t SCSR;       //28
    __IO uint16_t RESERVED8;
    __IO uint16_t EXTSCR;     //2c
    __IO uint16_t RESERVED9;
} SPI_TypeDef;


/**
* @brief TIM
*/
typedef struct {
    __IO uint16_t CR1;
    __IO uint16_t RESERVED0;
    __IO uint16_t CR2;
    __IO uint16_t RESERVED1;
    __IO uint16_t SMCR;
    __IO uint16_t RESERVED2;
    __IO uint16_t DIER;
    __IO uint16_t RESERVED3;
    __IO uint16_t SR;
    __IO uint16_t RESERVED4;
    __IO uint16_t EGR;
    __IO uint16_t RESERVED5;
    __IO uint16_t CCMR1;
    __IO uint16_t RESERVED6;
    __IO uint16_t CCMR2;
    __IO uint16_t RESERVED7;
    __IO uint16_t CCER;
    __IO uint16_t RESERVED8;
    __IO uint32_t CNT;    //16->32bit
    __IO uint16_t PSC;
    __IO uint16_t RESERVED10;
    __IO uint32_t ARR;    //16->32bit
    __IO uint16_t RCR;
    __IO uint16_t RESERVED12;
    __IO uint32_t CCR1;   //16->32bit
    __IO uint32_t CCR2;   //16->32bit
    __IO uint32_t CCR3;   //16->32bit
    __IO uint32_t CCR4;   //16->32bit
    __IO uint32_t BDTR;
    __IO uint16_t DCR;
    __IO uint16_t RESERVED18;
    __IO uint16_t DMAR;
    __IO uint16_t RESERVED19;
} TIM_TypeDef;


/**
* @brief Universal Synchronous Asynchronous Receiver Transmitter
*/
#define RXADDR  RXADD
typedef struct {
    __IO uint32_t TDR;
    __IO uint32_t RDR;
    __IO uint32_t CSR;
    __IO uint32_t ISR;
    __IO uint32_t IER;
    __IO uint32_t ICR;
    __IO uint32_t GCR;
    __IO uint32_t CCR;
    __IO uint32_t BRR;
    __IO uint32_t FRA;
    __IO uint32_t RXADD;
    __IO uint32_t RXMASK;
    __IO uint32_t SCR;
} UART_TypeDef;

/**
* @brief Window WATCHDOG
*/

typedef struct {
    __IO uint32_t CR;
    __IO uint32_t CFR;
    __IO uint32_t SR;
} WWDG_TypeDef;

//???chend:no document,not check
/**
* @brief QSPI
*/

typedef struct {
    __IO uint32_t INST_READ;
    __IO uint32_t INST_SET;
    __IO uint32_t SPEC;
    __IO uint32_t CLKGEN;
    __IO uint32_t DATA_ADDR;
    __IO uint32_t ENCRYPT;
    __IO uint32_t CHECKDATA;
    __IO uint32_t DATAPRO;
    __IO uint32_t DATAOPEN;
} QSPI_TypeDef;

/**
* @brief FSMC
*/
#define SSCONR  SCONR
#define SCSLR0  SCSLR0_LOW
#define SCSLR1  SCSLR1_LOW
#define SCSLR2  SCSLR2_LOW
#define SCSLR3  SCSLR3_LOW
#define SCSLR4  SCSLR4_LOW
#define SCSLR5  SCSLR5_LOW
#define SCSLR6  SCSLR6_LOW
#define SCSLR7  SCSLR7_LOW
typedef struct {
    __IO uint32_t SSCONR;          //0
    __IO uint32_t STMG0R;        //4
    __IO uint32_t STMG1R;        //8
    __IO uint32_t SCTLR;         //c
    __IO uint32_t SREFR;         //10
    __IO uint32_t SCSLR0_LOW;    //14
    __IO uint32_t SCSLR1_LOW;    //18
    __IO uint32_t SCSLR2_LOW;    //1c
    __IO uint32_t SCSLR3_LOW;    //20
    __IO uint32_t SCSLR4_LOW;    //24
    __IO uint32_t SCSLR5_LOW;    //28
    __IO uint32_t SCSLR6_LOW;    //2c
    __IO uint32_t SCSLR7_LOW;    //30
    __IO uint32_t RESERVED0;     //34
    __IO uint32_t RESERVED1;     //38
    __IO uint32_t RESERVED2;     //3c
    __IO uint32_t RESERVED3;     //40
    __IO uint32_t RESERVED4;     //44
    __IO uint32_t RESERVED5;     //48
    __IO uint32_t RESERVED6;     //4c
    __IO uint32_t RESERVED7;     //50
    __IO uint32_t SMSKR0;        //54
    __IO uint32_t SMSKR1;        //58
    __IO uint32_t SMSKR2;        //5c
    __IO uint32_t SMSKR3;        //60
    __IO uint32_t SMSKR4;        //64
    __IO uint32_t SMSKR5;        //68
    __IO uint32_t SMSKR6;        //6c
    __IO uint32_t SMSKR7;        //70
    __IO uint32_t CSALIAS0_LOW;  //74
    __IO uint32_t CSALIAS1_LOW;  //78
    __IO uint32_t RESERVED8;     //7c
    __IO uint32_t RESERVED9;     //80
    __IO uint32_t CSREMAP0_LOW;  //84
    __IO uint32_t CSREMAP1_LOW;  //88
    __IO uint32_t RESERVED10;    //8c
    __IO uint32_t RESERVED11;    //90
    __IO uint32_t SMTMGR_SET0;   //94
    __IO uint32_t SMTMGR_SET1;   //98
    __IO uint32_t SMTMGR_SET2;   //9c
    __IO uint32_t FLASH_TRPDR;   //a0
    __IO uint32_t SMCTLR;        //a4
    __IO uint32_t RESERVED17;    //a8
    __IO uint32_t EXN_MODE_REG;  //ac
} FSMC_TypeDef;

/**
* @brief TRNG
*/

typedef struct {
    __IO uint32_t CR;
    __IO uint32_t SR;
    __IO uint32_t IER;
    __IO uint32_t DR;
    __IO uint32_t NONCE_SEED1;
    __IO uint32_t NONCE_SEED2;
    __IO uint32_t NONCE_SEED3;

} TRNG_TypeDef;

/**
* @brief AES
*/
typedef struct {
    __IO uint32_t CR;
    __IO uint32_t SR;
    __IO uint32_t DINR;
    __IO uint32_t DOUTR;
    __IO uint32_t KEYR0;
    __IO uint32_t KEYR1;
    __IO uint32_t KEYR2;
    __IO uint32_t KEYR3;
    __IO uint32_t IVR0;
    __IO uint32_t IVR1;
    __IO uint32_t IVR2;
    __IO uint32_t IVR3;
    __IO uint32_t KEYR4;
    __IO uint32_t KEYR5;
    __IO uint32_t KEYR6;
    __IO uint32_t KEYR7;

} AES_TypeDef;


/**
* @brief USB_OTG_FS
*/
typedef struct {
    __IO uint32_t PER_ID;       //0x00
    __IO uint32_t ID_COMP;
    __IO uint32_t REV;
    __IO uint32_t ADD_INFO;
    __IO uint32_t OTG_INT_STAT; //0x10
    __IO uint32_t OTG_INT_EN;   //0x14
    __IO uint32_t OTG_STATUS;   //0x18
    __IO uint32_t OTG_CTRL;     //0x1c
    __IO uint32_t RESERVED1;    //0x20
    __IO uint32_t RESERVED2;    //0x24
    __IO uint32_t RESERVED3;    //0x28
    __IO uint32_t RESERVED4;    //0x2c
    __IO uint32_t RESERVED5;    //0x30
    __IO uint32_t RESERVED6;    //0x34
    __IO uint32_t RESERVED7;    //0x38
    __IO uint32_t RESERVED8;    //0x3c
    __IO uint32_t RESERVED9;    //0x40
    __IO uint32_t RESERVED10;    //0x44
    __IO uint32_t RESERVED11;   //0x48
    __IO uint32_t RESERVED12;   //0x4c
    __IO uint32_t RESERVED13;   //0x50
    __IO uint32_t RESERVED14;   //0x54
    __IO uint32_t RESERVED15;   //0x58
    __IO uint32_t RESERVED16;   //0x5c
    __IO uint32_t RESERVED17;   //0x60
    __IO uint32_t RESERVED18;   //0x64
    __IO uint32_t RESERVED19;   //0x68
    __IO uint32_t RESERVED20;   //0x6c
    __IO uint32_t RESERVED21;   //0x70
    __IO uint32_t RESERVED22;   //0x74
    __IO uint32_t RESERVED23;   //0x78
    __IO uint32_t RESERVED24;   //0x7c
    __IO uint32_t INT_STAT;     //0x80
    __IO uint32_t INT_ENB;
    __IO uint32_t ERR_STAT;
    __IO uint32_t ERR_ENB;
    __IO uint32_t STAT;         //0x90
    __IO uint32_t CTL;
    __IO uint32_t ADDR;
    __IO uint32_t BDT_PAGE_01;
    __IO uint32_t FRM_NUML;     //0xa0
    __IO uint32_t FRM_NUMH;
    __IO uint32_t TOKEN;
    __IO uint32_t SOF_THLD;
    __IO uint32_t BDT_PAGE_02;  //0xb0
    __IO uint32_t BDT_PAGE_03;  //0xb4
    __IO uint32_t RESERVED25;   //0xb8
    __IO uint32_t RESERVED26;   //0xbc
    __IO uint32_t EP_CTL0;      //0xc0
    __IO uint32_t EP_CTL1;      //0xc4
    __IO uint32_t EP_CTL2;      //0xc8
    __IO uint32_t EP_CTL3;      //0xcc
    __IO uint32_t EP_CTL4;      //0xd0
    __IO uint32_t EP_CTL5;      //0xd4
    __IO uint32_t EP_CTL6;      //0xd8
    __IO uint32_t EP_CTL7;      //0xdc
    __IO uint32_t EP_CTL8;      //0xe0
    __IO uint32_t EP_CTL9;      //0xe4
    __IO uint32_t EP_CTL10;     //0xe8
    __IO uint32_t EP_CTL11;     //0xec
    __IO uint32_t EP_CTL12;     //0xf0
    __IO uint32_t EP_CTL13;     //0xf4
    __IO uint32_t EP_CTL14;     //0xf8
    __IO uint32_t EP_CTL15;     //0xfc

} USB_OTG_FS_TypeDef;

