MikroElektronika/core_packages/ARM/gcc_clang/def/mindmotion/MM32F103CCT/mcu.h
typedef struct {
    __IO uint32_t FORMAT;
    __IO uint32_t ADRESS;
} BDT_DATA_TypeDef;

typedef struct {
    BDT_DATA_TypeDef RX_BUF[2];
    BDT_DATA_TypeDef TX_BUF[2];
} USB_OTG_BDT_TypeDef;


/**
* @brief SDIO
*/

typedef struct {
    __IO uint32_t MMC_CTRL;
    __IO uint32_t MMC_IO;
    __IO uint32_t MMC_BYTECNTL;
    __IO uint32_t MMC_TR_BLOCKCNT;
    __IO uint32_t MMC_CRCCTL;
    __IO uint32_t CMD_CRC;
    __IO uint32_t DAT_CRCL;
    __IO uint32_t DAT_CRCH;
    __IO uint32_t MMC_PORT;
    __IO uint32_t MMC_INT_MASK;
    __IO uint32_t CLR_MMC_INT;
    __IO uint32_t MMC_CARDSEL;
    __IO uint32_t MMC_SIG;
    __IO uint32_t MMC_IO_MBCTL;
    __IO uint32_t MMC_BLOCKCNT;
    __IO uint32_t MMC_TIMEOUTCNT;
    __IO uint32_t CMD_BUF0;
    __IO uint32_t CMD_BUF1;
    __IO uint32_t CMD_BUF2;
    __IO uint32_t CMD_BUF3;
    __IO uint32_t CMD_BUF4;
    __IO uint32_t CMD_BUF5;
    __IO uint32_t CMD_BUF6;
    __IO uint32_t CMD_BUF7;
    __IO uint32_t CMD_BUF8;
    __IO uint32_t CMD_BUF9;
    __IO uint32_t CMD_BUF10;
    __IO uint32_t CMD_BUF11;
    __IO uint32_t CMD_BUF12;
    __IO uint32_t CMD_BUF13;
    __IO uint32_t CMD_BUF14;
    __IO uint32_t CMD_BUF15;
    __IO uint32_t BUF_CTL;
    __IO uint32_t RESERVED[31];
    __IO uint32_t DATA_BUF0;
    __IO uint32_t DATA_BUF1;
    __IO uint32_t DATA_BUF2;
    __IO uint32_t DATA_BUF3;
    __IO uint32_t DATA_BUF4;

} SDIO_TypeDef;


/**
  * @brief Ethernet MAC
  */
typedef struct {
    __IO uint32_t MACCR;                    //0X0000
    __IO uint32_t MACFFR;                   //0X0004
    __IO uint32_t MACHTHR;              //0X0008
    __IO uint32_t MACHTLR;              //0X000C
    __IO uint32_t MACMIIAR;             //0X0010
    __IO uint32_t MACMIIDR;             //0x0014
    __IO uint32_t MACFCR;                   //0x0018
    __IO uint32_t MACVLANTR;            //0x001C
    __IO uint32_t RESERVED0[2];     //0x0020 ~ 0x0024
    __IO uint32_t MACRWUFFR;            //0x0028
    __IO uint32_t MACPMTCSR;        //0x002C
    //__IO uint32_t MACSR;          //0x0030
    //__IO uint32_t MACIMR;         //0x0034
    __IO uint32_t RESERVED1[4];     //0x0030 ~ 0x003C
    __IO uint32_t MACA0HR;              //0x0040
    __IO uint32_t MACA0LR;          //0x0044
    __IO uint32_t MACA1HR;          //0x0048
    __IO uint32_t MACA1LR;              //0x004C
    __IO uint32_t MACA2HR;              //0x0050
    __IO uint32_t MACA2LR;          //0x0054
    __IO uint32_t MACA3HR;          //0x0058
    __IO uint32_t MACA3LR;          //0x005C
    __IO uint32_t MACA4HR;          //0x0060
    __IO uint32_t MACA4LR;          //0x0064
    __IO uint32_t MACA5HR;          //0x0068
    __IO uint32_t MACA5LR;          //0x006C
    __IO uint32_t MACA6HR;          //0x0070
    __IO uint32_t MACA6LR;          //0x0074
    __IO uint32_t MACA7HR;          //0x0078
    __IO uint32_t MACA7LR;          //0x007C
    __IO uint32_t MACA8HR;          //0x0080
    __IO uint32_t MACA8LR;          //0x0084
    __IO uint32_t MACA9HR;          //0x0088
    __IO uint32_t MACA9LR;          //0x008C
    __IO uint32_t MACA10HR;         //0x0090
    __IO uint32_t MACA10LR;         //0x0094
    __IO uint32_t MACA11HR;         //0x0098
    __IO uint32_t MACA11LR;         //0x009C
    __IO uint32_t MACA12HR;         //0x00A0
    __IO uint32_t MACA12LR;         //0x00A4
    __IO uint32_t MACA13HR;         //0x00A8
    __IO uint32_t MACA13LR;         //0x00AC
    __IO uint32_t MACA14HR;         //0x00B0
    __IO uint32_t MACA14LR;         //0x00B4
    __IO uint32_t MACA15HR;         //0x00B8
    __IO uint32_t MACA15LR;             //0x00BC
    __IO uint32_t MACANCR;              //0x00C0
    __IO uint32_t MACANSR;              //0x00C4
    __IO uint32_t MACANAR;              //0x00C8
    __IO uint32_t MACANLPAR;            //0x00CC
    __IO uint32_t MACANER;              //0x00D0
    __IO uint32_t MACTBIER;             //0x00D4
    __IO uint32_t MACMIISR;             //0x00D8
    __IO uint32_t RESERVED2[9];     //0x00DC ~ 0x00FC
    __IO uint32_t MMCCR;            //0x0100
    __IO uint32_t MMCRIR;           //0x0104
    __IO uint32_t MMCTIR;           //0x0108
    __IO uint32_t MMCRIMR;          //0x010C
    __IO uint32_t MMCTIMR;          //0x0110
    __IO uint32_t RESERVED3[14];    //0x0114 ~ 0x0148
    __IO uint32_t MMCTGFSCCR;       //0x014C
    __IO uint32_t MMCTGFMSCCR;      //0x0150
    __IO uint32_t RESERVED4[5];     //0x0154 ~ 0x0164
    __IO uint32_t MMCTGFCR;         //0x0168
    __IO uint32_t RESERVED5[10];    //0x016C ~ 0x0190
    __IO uint32_t MMCRFCECR;        //0x0194
    __IO uint32_t MMCRFAECR;        //0x0198
    __IO uint32_t RESERVED6[10];    //0x019C ~ 0x01C0
    __IO uint32_t MMCRGUFCR;        //0x01C4
} ETH_MAC_TypeDef;

/**
  * @brief Ethernet DMA
  */
typedef struct {
    __IO uint32_t DMABMR;           //0x1000
    __IO uint32_t DMATPDR;          //0x1004
    __IO uint32_t DMARPDR;          //0x1008
    __IO uint32_t DMARDLAR;         //0x100C
    __IO uint32_t DMATDLAR;         //0x1010
    __IO uint32_t DMASR;            //0x1014
    __IO uint32_t DMAOMR;           //0x1018
    __IO uint32_t DMAIER;           //0x101C
    __IO uint32_t DMAMFBOCR;        //0x1020
    __IO uint32_t RESERVED10[9];    //0x1024 ~ 0x1044
    __IO uint32_t DMACHTDR;         //0x1048
    __IO uint32_t DMACHRDR;         //0x104C
    __IO uint32_t DMACHTBAR;        //0x1050
    __IO uint32_t DMACHRBAR;        //0x1054
} ETH_DMA_TypeDef;



/**
* @}
*/

#define HARD_FAULT_MM         ((HARD_FAULT_TypeDef*)0xE000DE24)

/** @addtogroup Peripheral_memory_map
* @{
*/

#define FLASH_BASE            ((uint32_t)0x08000000) /*!< FLASH base address in the alias region */
#define OB_BASE               ((uint32_t)0x1FFFF800) /*!< Flash Option Bytes base address */
#define SECURITY_MEM_BASE     ((uint32_t)0x1FFE1000) /*!< Special security memory base address */
#define PROTECT_BYTE_R_BASE   ((uint32_t)0x1FFE0000) /*!< Protect byte register base address */
#define EEPROM_BASE           ((uint32_t)0x08100000) /*!< EEPROM base address in the alias region */

#define PERIPH_BB_BASE        ((uint32_t)0x42000000) /*!< Peripheral base address in the alias region */
#define SRAM_BB_BASE          ((uint32_t)0x22000000) /*!< SRAM base address in the alias region */

#define SRAM_BASE             ((uint32_t)0x20000000) /*!< Peripheral base address in the bit-band region */
#define PERIPH_BASE           ((uint32_t)0x40000000) /*!< SRAM base address in the bit-band region */



/*!< Peripheral memory map */
#define APB1PERIPH_BASE       PERIPH_BASE
#define APB2PERIPH_BASE       (PERIPH_BASE + 0x10000)
#define AHB1PERIPH_BASE       (PERIPH_BASE + 0x20000)

