MikroElektronika/core_packages/ARM/gcc_clang/def/mindmotion/MM32F103CCT/mcu.h
#define TIM2_BASE             (APB1PERIPH_BASE + 0x0000)
#define TIM3_BASE             (APB1PERIPH_BASE + 0x0400)
#define TIM4_BASE             (APB1PERIPH_BASE + 0x0800)
#define TIM5_BASE             (APB1PERIPH_BASE + 0x0C00)
#define TIM6_BASE             (APB1PERIPH_BASE + 0x1000)
#define TIM7_BASE             (APB1PERIPH_BASE + 0x1400)

#define RTC_BASE              (APB1PERIPH_BASE + 0x2800)
#define BKP_BASE              (APB1PERIPH_BASE + 0x2800 + 0x24)
#define WWDG_BASE             (APB1PERIPH_BASE + 0x2C00)
#define IWDG_BASE             (APB1PERIPH_BASE + 0x3000)
#define SPI2_BASE             (APB1PERIPH_BASE + 0x3800)
#define SPI3_BASE             (APB1PERIPH_BASE + 0x3C00)

#define UART2_BASE            (APB1PERIPH_BASE + 0x4400)
#define UART3_BASE            (APB1PERIPH_BASE + 0x4800)
#define UART4_BASE            (APB1PERIPH_BASE + 0x4C00)
#define UART5_BASE            (APB1PERIPH_BASE + 0x5000)

#define I2C1_BASE             (APB1PERIPH_BASE + 0x5400)
#define I2C2_BASE             (APB1PERIPH_BASE + 0x5800)
#define CAN1_BASE             (APB1PERIPH_BASE + 0x6400)
#define CRS_BASE              (APB1PERIPH_BASE + 0x6C00)
#define PWR_BASE              (APB1PERIPH_BASE + 0x7000)

#define UART7_BASE            (APB1PERIPH_BASE + 0x7800)
#define UART8_BASE            (APB1PERIPH_BASE + 0x7C00)

#define EXTI_BASE             (APB2PERIPH_BASE + 0x0400)
#define SYSCFG_BASE           (APB2PERIPH_BASE + 0x0000)
#define COMP_BASE             (APB2PERIPH_BASE + 0x001C)

#define ADC1_BASE             (APB2PERIPH_BASE + 0x2400)
#define TIM1_BASE             (APB2PERIPH_BASE + 0x2C00)
#define SPI1_BASE             (APB2PERIPH_BASE + 0x3000)

#define TIM8_BASE             (APB2PERIPH_BASE + 0x3400)
#define UART1_BASE            (APB2PERIPH_BASE + 0x3800)
#define UART6_BASE            (APB2PERIPH_BASE + 0x3C00)
#define CACHE_BASE            (APB2PERIPH_BASE + 0x6000)

#define SDIO_BASE             (0x40018000)

#define DMA1_BASE             (AHB1PERIPH_BASE + 0x0000)
#define DMA1_Channel1_BASE    (AHB1PERIPH_BASE + 0x0008)
#define DMA1_Channel2_BASE    (AHB1PERIPH_BASE + 0x001C)
#define DMA1_Channel3_BASE    (AHB1PERIPH_BASE + 0x0030)
#define DMA1_Channel4_BASE    (AHB1PERIPH_BASE + 0x0044)
#define DMA1_Channel5_BASE    (AHB1PERIPH_BASE + 0x0058)
#define DMA1_Channel6_BASE    (AHB1PERIPH_BASE + 0x006C)
#define DMA1_Channel7_BASE    (AHB1PERIPH_BASE + 0x0080)

#define DMA2_BASE             (AHB1PERIPH_BASE + 0x0400)
#define DMA2_Channel1_BASE    (AHB1PERIPH_BASE + 0x0408)
#define DMA2_Channel2_BASE    (AHB1PERIPH_BASE + 0x041C)
#define DMA2_Channel3_BASE    (AHB1PERIPH_BASE + 0x0430)
#define DMA2_Channel4_BASE    (AHB1PERIPH_BASE + 0x0444)
#define DMA2_Channel5_BASE    (AHB1PERIPH_BASE + 0x0458)

#define RCC_BASE              (AHB1PERIPH_BASE + 0x1000)
#define FLASH_R_BASE          (AHB1PERIPH_BASE + 0x2000) /*!< Flash registers base address */
#define CRC_BASE              (AHB1PERIPH_BASE + 0x3000)

#define ETH_BASE              (AHB1PERIPH_BASE + 0x8000)
#define ETH_MAC_BASE          (AHB1PERIPH_BASE + 0x8000)
#define ETH_DMA_BASE          (AHB1PERIPH_BASE + 0x9000)

#define GPIOA_BASE            (0x48000000)
#define GPIOB_BASE            (0x48000400)
#define GPIOC_BASE            (0x48000800)
#define GPIOD_BASE            (0x48000C00)
#define GPIOE_BASE            (0x48001000)

#define USB_OTG_FS_BASE       (0x50000000)
#define AES_BASE              (0x50060000)
#define TRNG_BASE             (0x50060800)

#define FSMC_BANK1_ADDR       (0x60000000)
#define FSMC_BANK2_ADDR       (0x64000000)
#define FSMC_BANK3_ADDR       (0x68000000)
#define FSMC_BANK4_ADDR       (0x6c000000)

#define FSMC_R_BASE           (0xA0000000)
#define QSPI_R_BASE           (0xA0001000)

#define DBGMCU_BASE           ((uint32_t)0xE0042000) /*!< Debug MCU registers base address */


/**
* @}
*/

/** @addtogroup Peripheral_declaration
* @{
*/
#define TIM2                ((TIM_TypeDef *) TIM2_BASE)
#define TIM3                ((TIM_TypeDef *) TIM3_BASE)
#define TIM4                ((TIM_TypeDef *) TIM4_BASE)
#define TIM5                ((TIM_TypeDef *) TIM5_BASE)
#define TIM6                ((TIM_TypeDef *) TIM6_BASE)
#define TIM7                ((TIM_TypeDef *) TIM7_BASE)

#define RTC                 ((RTC_TypeDef *) RTC_BASE)
#define BKP                 ((BKP_TypeDef *) BKP_BASE)
#define WWDG                ((WWDG_TypeDef *) WWDG_BASE)
#define IWDG                ((IWDG_TypeDef *) IWDG_BASE)
#define SPI2                ((SPI_TypeDef *) SPI2_BASE)
#define SPI3                ((SPI_TypeDef *) SPI3_BASE)
#define UART2               ((UART_TypeDef *) UART2_BASE)
#define UART3               ((UART_TypeDef *) UART3_BASE)
#define UART4               ((UART_TypeDef *) UART4_BASE)
#define UART5               ((UART_TypeDef *) UART5_BASE)

#define I2C1                ((I2C_TypeDef *) I2C1_BASE)
#define I2C2                ((I2C_TypeDef *) I2C2_BASE)
#define CAN1                ((CAN_TypeDef *) CAN1_BASE)
#define CAN1_BASIC          ((CAN_TypeDef *) CAN1_BASE)
#define CAN1_PELI           ((CAN_Peli_TypeDef *) CAN1_BASE)
#define PWR                 ((PWR_TypeDef *) PWR_BASE)
#define UART7               ((UART_TypeDef *) UART7_BASE)
#define UART8               ((UART_TypeDef *) UART8_BASE)

#define COMP                ((COMP_TypeDef *) COMP_BASE)
#define SYSCFG              ((SYSCFG_TypeDef *) SYSCFG_BASE)
#define EXTI                ((EXTI_TypeDef *) EXTI_BASE)

#define ADC1                ((ADC_TypeDef *) ADC1_BASE)
#define TIM1                ((TIM_TypeDef *) TIM1_BASE)
#define SPI1                ((SPI_TypeDef *) SPI1_BASE)
#define TIM8                ((TIM_TypeDef *) TIM8_BASE)
#define UART1               ((UART_TypeDef *) UART1_BASE)
#define UART6               ((UART_TypeDef *) UART6_BASE)

#define CACHE               ((CACHE_TypeDef*) CACHE_BASE)
#define SDIO                ((SDIO_TypeDef *) SDIO_BASE)

#define DMA1                ((DMA_TypeDef *) DMA1_BASE)
#define DMA1_Channel1       ((DMA_Channel_TypeDef *) DMA1_Channel1_BASE)
#define DMA1_Channel2       ((DMA_Channel_TypeDef *) DMA1_Channel2_BASE)
#define DMA1_Channel3       ((DMA_Channel_TypeDef *) DMA1_Channel3_BASE)
#define DMA1_Channel4       ((DMA_Channel_TypeDef *) DMA1_Channel4_BASE)
#define DMA1_Channel5       ((DMA_Channel_TypeDef *) DMA1_Channel5_BASE)
#define DMA1_Channel6       ((DMA_Channel_TypeDef *) DMA1_Channel6_BASE)
#define DMA1_Channel7       ((DMA_Channel_TypeDef *) DMA1_Channel7_BASE)

