MikroElektronika/core_packages/ARM/gcc_clang/def/mindmotion/MM32F103CCT/mcu.h
/******************  Bit definition for RCC_AHB3RSTR register  ******************/
#define  RCC_AHB3RSTR_FSMCRST                ((uint32_t)0x00000001)            /*!< FSMC reset */
#define  RCC_AHB3RSTR_QSPIRST                ((uint32_t)0x00000002)            /*!< QSPI reset */

/******************  Bit definition for RCC_AHB2RSTR register  ******************/
#define  RCC_AHB2RSTR_AESRST                 ((uint32_t)0x00000010)            /*!< AES reset */
#define  RCC_AHB2RSTR_RNGRST                 ((uint32_t)0x00000040)            /*!< RNG reset */
#define  RCC_AHB2RSTR_OTGFSRST               ((uint32_t)0x00000080)            /*!< OTGFS reset */

/******************  Bit definition for RCC_AHB1RSTR register  ******************/
#define  RCC_AHB1RSTR_GPIOARST               ((uint32_t)0x00000001)            /*!< GPIOA reset */
#define  RCC_AHB1RSTR_GPIOBRST               ((uint32_t)0x00000002)            /*!< GPIOB reset */
#define  RCC_AHB1RSTR_GPIOCRST               ((uint32_t)0x00000004)            /*!< GPIOC reset */
#define  RCC_AHB1RSTR_GPIODRST               ((uint32_t)0x00000008)            /*!< GPIOD reset */
#define  RCC_AHB1RSTR_GPIOERST               ((uint32_t)0x00000010)            /*!< GPIOE reset */
#define  RCC_AHB1RSTR_SDIORST                ((uint32_t)0x00000400)            /*!< SDIO reset */
#define  RCC_AHB1RSTR_CRCRST                 ((uint32_t)0x00001000)            /*!< CRC reset */
#define  RCC_AHB1RSTR_DMA1RST                ((uint32_t)0x00200000)            /*!< DMA1 reset */
#define  RCC_AHB1RSTR_DMA2RST                ((uint32_t)0x00400000)            /*!< DMA2 reset */
#define  RCC_AHB1RSTR_ETHMACRST              ((uint32_t)0x02000000)            /*!< ETHMAC reset */

/*****************  Bit definition for RCC_APB2RSTR register  *****************/
#define  RCC_APB2RSTR_TIM1RST                ((uint32_t)0x00000001)            /*!< Timer 1 reset */
#define  RCC_APB2RSTR_TIM8RST                ((uint32_t)0x00000002)            /*!< Timer 8 reset */
#define  RCC_APB2RSTR_UART1RST               ((uint32_t)0x00000010)            /*!< U ART1 reset */
#define  RCC_APB2RSTR_UART6RST               ((uint32_t)0x00000020)            /*!< U ART6 reset */
#define  RCC_APB2RSTR_ADC1RST                ((uint32_t)0x00000100)            /*!< ADC 1 interface reset */
#define  RCC_APB2RSTR_SPI1RST                ((uint32_t)0x00001000)            /*!< SPI1 reset */
#define  RCC_APB2RSTR_SYSCFGRST              ((uint32_t)0x00004000)            /*!< SYSCFG reset */
#define  RCC_APB2RSTR_COMPRST                ((uint32_t)0x00008000)            /*!< COMP reset */

/*****************  Bit definition for RCC_APB1RSTR register  *****************/
#define  RCC_APB1RSTR_TIM2RST                ((uint32_t)0x00000001)        /*!< Timer 2 reset */
#define  RCC_APB1RSTR_TIM3RST                ((uint32_t)0x00000002)        /*!< Timer 3 reset */
#define  RCC_APB1RSTR_TIM4RST                ((uint32_t)0x00000004)        /*!< Timer 4 reset */
#define  RCC_APB1RSTR_TIM5RST                ((uint32_t)0x00000008)        /*!< Timer 5 reset */
#define  RCC_APB1RSTR_TIM6RST                ((uint32_t)0x00000010)        /*!< Timer 6 reset */
#define  RCC_APB1RSTR_TIM7RST                ((uint32_t)0x00000020)        /*!< Timer 7 reset */
#define  RCC_APB1RSTR_WWDGRST                ((uint32_t)0x00000800)        /*!< Window Watchdog reset */
#define  RCC_APB1RSTR_SPI2RST                ((uint32_t)0x00004000)        /*!< SPI 2 reset */
#define  RCC_APB1RSTR_SPI3RST                ((uint32_t)0x00008000)        /*!< SPI 3 reset */
#define  RCC_APB1RSTR_UART2RST               ((uint32_t)0x00020000)        /*!< UART 2 reset */
#define  RCC_APB1RSTR_UART3RST               ((uint32_t)0x00040000)        /*!< UART 3 reset */
#define  RCC_APB1RSTR_UART4RST               ((uint32_t)0x00080000)        /*!< UART 4 reset */
#define  RCC_APB1RSTR_UART5RST               ((uint32_t)0x00100000)        /*!< UART 5 reset */
#define  RCC_APB1RSTR_I2C1RST                ((uint32_t)0x00200000)        /*!< I2C 1 reset */
#define  RCC_APB1RSTR_I2C2RST                ((uint32_t)0x00400000)        /*!< I2C 2 reset */
#define  RCC_APB1RSTR_CRSRST                 ((uint32_t)0x01000000)        /*!< CRS reset */
#define  RCC_APB1RSTR_CANRST                 ((uint32_t)0x02000000)        /*!< CAN reset */
#define  RCC_APB1RSTR_BKPRST                 ((uint32_t)0x08000000)        /*!< Backup interface reset */
#define  RCC_APB1RSTR_PWRRST                 ((uint32_t)0x10000000)        /*!< Power interface reset */
#define  RCC_APB1RSTR_UART7RST               ((uint32_t)0x40000000)        /*!< UART 7 reset */
#define  RCC_APB1RSTR_UART8RST               ((uint32_t)0x80000000)        /*!< UART 8 reset */

/******************  Bit definition for RCC_AHB3ENR register  ******************/
#define  RCC_AHB3ENR_FSMCEN                 ((uint32_t)0x00000001)            /*!< FSMC clock enable */
#define  RCC_AHB3ENR_QSPIEN                 ((uint32_t)0x00000002)            /*!< QSPI clock enable */

/******************  Bit definition for RCC_AHB2ENR register  ******************/
#define  RCC_AHB2ENR_AESEN                  ((uint32_t)0x00000010)            /*!< AES clock enable */
#define  RCC_AHB2ENR_RNGEN                  ((uint32_t)0x00000040)            /*!< RNG clock enable */
#define  RCC_AHB2ENR_OTGFSEN                ((uint32_t)0x00000080)            /*!< OTGFS clock enable */

/******************  Bit definition for RCC_AHB1ENR register  ******************/
#define  RCC_AHB1ENR_GPIOAEN                ((uint32_t)0x00000001)            /*!< GPIOA clock enable */
#define  RCC_AHB1ENR_GPIOBEN                ((uint32_t)0x00000002)            /*!< GPIOB clock enable */
#define  RCC_AHB1ENR_GPIOCEN                ((uint32_t)0x00000004)            /*!< GPIOC clock enable */
#define  RCC_AHB1ENR_GPIODEN                ((uint32_t)0x00000008)            /*!< GPIOD clock enable */
#define  RCC_AHB1ENR_GPIOEEN                ((uint32_t)0x00000010)            /*!< GPIOE clock enable */
#define  RCC_AHB1ENR_SDIOEN                 ((uint32_t)0x00000400)            /*!< SDIO clock enable */
#define  RCC_AHB1ENR_CRCEN                  ((uint32_t)0x00001000)            /*!< CRC clock enable */
#define  RCC_AHB1ENR_FLASHEN                ((uint32_t)0x00002000)            /*!< FLASH clock enable */
#define  RCC_AHB1ENR_SRAMEN                 ((uint32_t)0x00004000)            /*!< FLASH clock enable */
#define  RCC_AHB1ENR_DMA1EN                 ((uint32_t)0x00200000)            /*!< DMA1 clock enable */
#define  RCC_AHB1ENR_DMA2EN                 ((uint32_t)0x00400000)            /*!< DMA2 clock enable */
#define  RCC_AHB1ENR_ETHMACEN               ((uint32_t)0x02000000)            /*!< ETHMAC clock enable */

