MikroElektronika/core_packages/ARM/gcc_clang/def/mindmotion/MM32F103CCT/mcu.h
/******************  Bit definition for RCC_APB2ENR register  *****************/
#define  RCC_APB2ENR_TIM1EN                 ((uint32_t)0x00000001)            /*!< Timer 1 clock enable */
#define  RCC_APB2ENR_TIM8EN                 ((uint32_t)0x00000002)            /*!< Timer 8 clock enable */
#define  RCC_APB2ENR_UART1EN                ((uint32_t)0x00000010)            /*!< UART1 clock enable */
#define  RCC_APB2ENR_UART6EN                ((uint32_t)0x00000020)            /*!< UART6 clock enable */
#define  RCC_APB2ENR_ADC1EN                 ((uint32_t)0x00000100)            /*!< ADC 1 interface clock enable */
#define  RCC_APB2ENR_SPI1EN                 ((uint32_t)0x00001000)            /*!< SPI1 clock enable */
#define  RCC_APB2ENR_SYSCFGEN               ((uint32_t)0x00004000)            /*!< SYSCFG clock enable */
#define  RCC_APB2ENR_COMPEN                 ((uint32_t)0x00008000)            /*!< COMP clock enable */

/*****************  Bit definition for RCC_APB1ENR register  ******************/
#define  RCC_APB1ENR_TIM2EN                 ((uint32_t)0x00000001)        /*!< Timer 2 clock enable */
#define  RCC_APB1ENR_TIM3EN                 ((uint32_t)0x00000002)        /*!< Timer 3 clock enable */
#define  RCC_APB1ENR_TIM4EN                 ((uint32_t)0x00000004)        /*!< Timer 4 clock enable */
#define  RCC_APB1ENR_TIM5EN                 ((uint32_t)0x00000008)        /*!< Timer 5 clock enable */
#define  RCC_APB1ENR_TIM6EN                 ((uint32_t)0x00000010)        /*!< Timer 6 clock enable */
#define  RCC_APB1ENR_TIM7EN                 ((uint32_t)0x00000020)        /*!< Timer 7 clock enable */
#define  RCC_APB1ENR_WWDGEN                 ((uint32_t)0x00000800)        /*!< Window Watchdog clock enable */
#define  RCC_APB1ENR_SPI2EN                 ((uint32_t)0x00004000)        /*!< SPI 2 clock enable */
#define  RCC_APB1ENR_SPI3EN                 ((uint32_t)0x00008000)        /*!< SPI 3 clock enable */
#define  RCC_APB1ENR_UART2EN                ((uint32_t)0x00020000)        /*!< UART 2 clock enable */
#define  RCC_APB1ENR_UART3EN                ((uint32_t)0x00040000)        /*!< UART 3 clock enable */
#define  RCC_APB1ENR_UART4EN                ((uint32_t)0x00080000)        /*!< UART 4 clock enable */
#define  RCC_APB1ENR_UART5EN                ((uint32_t)0x00100000)        /*!< UART 5 clock enable */
#define  RCC_APB1ENR_I2C1EN                 ((uint32_t)0x00200000)        /*!< I2C 1 clock enable */
#define  RCC_APB1ENR_I2C2EN                 ((uint32_t)0x00400000)        /*!< I2C 2 clock enable */
#define  RCC_APB1ENR_CRSEN                  ((uint32_t)0x01000000)        /*!< CRS clock enable */
#define  RCC_APB1ENR_CANEN                  ((uint32_t)0x02000000)        /*!< CAN clock enable */
#define  RCC_APB1ENR_BKPEN                  ((uint32_t)0x08000000)        /*!< Backup interface clock enable */
#define  RCC_APB1ENR_PWREN                  ((uint32_t)0x10000000)        /*!< Power interface clock enable */
#define  RCC_APB1ENR_UART7EN                ((uint32_t)0x40000000)        /*!< UART 7 clock enable */
#define  RCC_APB1ENR_UART8EN                ((uint32_t)0x80000000)        /*!< UART 8 clock enable */

/*******************  Bit definition for RCC_BDCR register  *******************/
#define  RCC_BDCR_LSEON                      ((uint32_t)0x00000001)        /*!< External Low Speed oscillator enable */
#define  RCC_BDCR_LSERDY                     ((uint32_t)0x00000002)        /*!< External Low Speed oscillator Ready */
#define  RCC_BDCR_LSEBYP                     ((uint32_t)0x00000004)        /*!< External Low Speed oscillator Bypass */

#define  RCC_BDCR_RTCSEL                     ((uint32_t)0x00000300)        /*!< RTCSEL[1:0] bits (RTC clock source selection) */
#define  RCC_BDCR_RTCSEL_0                   ((uint32_t)0x00000100)        /*!< Bit 0 */
#define  RCC_BDCR_RTCSEL_1                   ((uint32_t)0x00000200)        /*!< Bit 1 */

/*!< BDCR_RTCSEL configuration */
#define  RCC_BDCR_RTCSEL_NOCLOCK             ((uint32_t)0x00000000)        /*!< No clock */
#define  RCC_BDCR_RTCSEL_LSE                 ((uint32_t)0x00000100)        /*!< LSE oscillator clock used as RTC clock */
#define  RCC_BDCR_RTCSEL_LSI                 ((uint32_t)0x00000200)        /*!< LSI oscillator clock used as RTC clock */
#define  RCC_BDCR_RTCSEL_HSE                 ((uint32_t)0x00000300)        /*!< HSE oscillator clock divided by 128 used as RTC clock */

#define  RCC_BDCR_RTCEN                      ((uint32_t)0x00008000)        /*!< RTC clock enable */
#define  RCC_BDCR_BDRST                      ((uint32_t)0x00010000)        /*!< Backup domain software reset  */

/*******************  Bit definition for RCC_CSR register  ********************/
#define  RCC_CSR_LSION                       ((uint32_t)0x00000001)        /*!< Internal Low Speed oscillator enable */
#define  RCC_CSR_LSIRDY                      ((uint32_t)0x00000002)        /*!< Internal Low Speed oscillator Ready */
#define  RCC_CSR_RMVF                        ((uint32_t)0x01000000)        /*!< Remove reset flag */
#define  RCC_CSR_PINRSTF                     ((uint32_t)0x04000000)        /*!< PIN reset flag */
#define  RCC_CSR_PORRSTF                     ((uint32_t)0x08000000)        /*!< POR/PDR reset flag */
#define  RCC_CSR_SFTRSTF                     ((uint32_t)0x10000000)        /*!< Software Reset flag */
#define  RCC_CSR_IWDGRSTF                    ((uint32_t)0x20000000)        /*!< Independent Watchdog reset flag */
#define  RCC_CSR_WWDGRSTF                    ((uint32_t)0x40000000)        /*!< Window watchdog reset flag */
#define  RCC_CSR_LPWRRSTF                    ((uint32_t)0x80000000)        /*!< Low-Power reset flag */

/*******************  Bit definition for RCC_SYSCFG register  ********************/
#define  RCC_SYSCFG_PROG_CHECK_EN            ((uint32_t)0x00000001)        /*!< Program check enable */
#define  RCC_SYSCFG_SECTOR_1K_CFG            ((uint32_t)0x00000002)        /*!< Page size when FLASH page is erased */
#define  RCC_SYSCFG_DATA_PREFETCH            ((uint32_t)0x00000004)        /*!< DATA prefetch module enabled */
#define  RCC_SYSCFG_PAD_OSC_TRIM             ((uint32_t)0x00001F00)        /*!< External crystal calibration value */

#define  RCC_SYSCFG_QSPI_CLKP_DIV            ((uint32_t)0x007F0000)        /*!< QSPI_CLKP_DIV[22:16] bits (QSPI clock prescaler) */
#define  RCC_SYSCFG_QSPI_CLKP_DIV_0          ((uint32_t)0x00010000)        /*!< Bit 0 */
#define  RCC_SYSCFG_QSPI_CLKP_DIV_1          ((uint32_t)0x00020000)        /*!< Bit 1 */
#define  RCC_SYSCFG_QSPI_CLKP_DIV_2          ((uint32_t)0x00040000)        /*!< Bit 2 */
#define  RCC_SYSCFG_QSPI_CLKP_DIV_3          ((uint32_t)0x00080000)        /*!< Bit 3 */

