MikroElektronika/core_packages/ARM/gcc_clang/def/mindmotion/MM32F103CCT/mcu.h
/*******************  Bit definition for CAN_TXID1 register  *******************/
#define  CAN_TXID1_DLC                       ((uint16_t)0x000F)
#define  CAN_TXID1_DLC_0                     ((uint16_t)0x0001)
#define  CAN_TXID1_DLC_1                     ((uint16_t)0x0002)
#define  CAN_TXID1_DLC_2                     ((uint16_t)0x0004)
#define  CAN_TXID1_DLC_3                     ((uint16_t)0x0008)

#define  CAN_TXID1_RTR                       ((uint16_t)0x0010)

#define  CAN_TXID1_ID                        ((uint16_t)0x00E0)
#define  CAN_TXID1_ID_0                      ((uint16_t)0x0020)
#define  CAN_TXID1_ID_1                      ((uint16_t)0x0040)
#define  CAN_TXID1_ID_2                      ((uint16_t)0x0080)

/*******************  Bit definition for CAN_TXDR0 register  *******************/
#define  CAN_TXDR0                           ((uint16_t)0x00FF)
/*******************  Bit definition for CAN_TXDR1 register  *******************/
#define  CAN_TXDR1                           ((uint16_t)0x00FF)
/*******************  Bit definition for CAN_TXDR2 register  *******************/
#define  CAN_TXDR2                           ((uint16_t)0x00FF)
/*******************  Bit definition for CAN_TXDR3 register  *******************/
#define  CAN_TXDR3                           ((uint16_t)0x00FF)
/*******************  Bit definition for CAN_TXDR4 register  *******************/
#define  CAN_TXDR4                           ((uint16_t)0x00FF)
/*******************  Bit definition for CAN_TXDR5 register  *******************/
#define  CAN_TXDR5                           ((uint16_t)0x00FF)
/*******************  Bit definition for CAN_TXDR6 register  *******************/
#define  CAN_TXDR6                           ((uint16_t)0x00FF)
/*******************  Bit definition for CAN_TXDR7 register  *******************/
#define  CAN_TXDR7                           ((uint16_t)0x00FF)

/*******************  Bit definition for CAN_RXID1 register  *******************/
#define  CAN_RXID1_ID                        ((uint16_t)0x00FF)
#define  CAN_RXID1_ID_3                      ((uint16_t)0x0001)
#define  CAN_RXID1_ID_4                      ((uint16_t)0x0002)
#define  CAN_RXID1_ID_5                      ((uint16_t)0x0004)
#define  CAN_RXID1_ID_6                      ((uint16_t)0x0008)
#define  CAN_RXID1_ID_7                      ((uint16_t)0x0010)
#define  CAN_RXID1_ID_8                      ((uint16_t)0x0020)
#define  CAN_RXID1_ID_9                      ((uint16_t)0x0040)
#define  CAN_RXID1_ID_10                     ((uint16_t)0x0080)

/*******************  Bit definition for CAN_RXID2 register  *******************/
#define  CAN_RXID2_RTR                       ((uint16_t)0x0010)

#define  CAN_RXID2_DLC                       ((uint16_t)0x000F)
#define  CAN_RXID2_DLC_0                     ((uint16_t)0x0001)
#define  CAN_RXID2_DLC_1                     ((uint16_t)0x0002)
#define  CAN_RXID2_DLC_2                     ((uint16_t)0x0004)
#define  CAN_RXID2_DLC_3                     ((uint16_t)0x0008)

#define  CAN_RXID2_ID                        ((uint16_t)0x00E0)
#define  CAN_RXID2_ID_0                      ((uint16_t)0x0020)
#define  CAN_RXID2_ID_1                      ((uint16_t)0x0040)
#define  CAN_RXID2_ID_2                      ((uint16_t)0x0080)

/*******************  Bit definition for CAN_RXDR0 register  *******************/
#define  CAN_RXDR0                           ((uint16_t)0x00FF)
/*******************  Bit definition for CAN_RXDR1 register  *******************/
#define  CAN_RXDR1                           ((uint16_t)0x00FF)
/*******************  Bit definition for CAN_RXDR2 register  *******************/
#define  CAN_RXDR2                           ((uint16_t)0x00FF)
/*******************  Bit definition for CAN_RXDR3 register  *******************/
#define  CAN_RXDR3                           ((uint16_t)0x00FF)
/*******************  Bit definition for CAN_RXDR4 register  *******************/
#define  CAN_RXDR4                           ((uint16_t)0x00FF)
/*******************  Bit definition for CAN_RXDR5 register  *******************/
#define  CAN_RXDR5                           ((uint16_t)0x00FF)
/*******************  Bit definition for CAN_RXDR6 register  *******************/
#define  CAN_RXDR6                           ((uint16_t)0x00FF)
/*******************  Bit definition for CAN_RXDR7 register  *******************/
#define  CAN_RXDR7                           ((uint16_t)0x00FF)

/*!<PeliCAN registers */
/*******************  Bit definition for CAN_MOD register  *******************/
#define  CAN_MOD_RM                                                  ((uint16_t)0x0001)
#define  CAN_MOD_LOM                                                 ((uint16_t)0x0002)
#define  CAN_MOD_STM                                                 ((uint16_t)0x0004)
#define  CAN_MOD_AFM                                                 ((uint16_t)0x0008)

/*******************  Bit definition for CAN_IER register  *******************/
#define  CAN_IER_RIE                                                 ((uint16_t)0x0001)
#define  CAN_IER_TIE                                                 ((uint16_t)0x0002)
#define  CAN_IER_EIE                                                 ((uint16_t)0x0004)
#define  CAN_IER_DOIE                                                ((uint16_t)0x0008)
#define  CAN_IER_WUIE                                                ((uint16_t)0x0010)
#define  CAN_IER_EPIE                                                ((uint16_t)0x0020)
#define  CAN_IER_ALIE                                                ((uint16_t)0x0040)
#define  CAN_IER_BEIE                                                ((uint16_t)0x0080)

/*******************  Bit definition for CAN_ALC register  *******************/
#define  CAN_ALC_BITNO                                           ((uint16_t)0x001F)
#define  CAN_ALC_BITNO_0                                         ((uint16_t)0x0001)
#define  CAN_ALC_BITNO_1                                         ((uint16_t)0x0002)
#define  CAN_ALC_BITNO_2                                         ((uint16_t)0x0004)
#define  CAN_ALC_BITNO_3                                         ((uint16_t)0x0008)
#define  CAN_ALC_BITNO_4                                         ((uint16_t)0x0010)

