MikroElektronika/core_packages/ARM/gcc_clang/def/mindmotion/MM32F103CCT/mcu.h
#define  AES_CR_CHMOD                        ((uint32_t)0x00000060)        /*!< AES Chaining Mode */
#define  AES_CR_CHMOD_0                      ((uint32_t)0x00000020)        /*!< Bit 0 */
#define  AES_CR_CHMOD_1                      ((uint32_t)0x00000040)        /*!< Bit 1 */

#define  AES_CR_CCFC                         ((uint32_t)0x00000080)        /*!< Computation Complete Flag Clear */
#define  AES_CR_ERRC                         ((uint32_t)0x00000100)        /*!< Error Clear */
#define  AES_CR_CCFIE                        ((uint32_t)0x00000200)        /*!< Computation Complete Interrupt Enable */
#define  AES_CR_ERRIE                        ((uint32_t)0x00000400)        /*!< Error Interrupt Enable */
#define  AES_CR_DMAINEN                      ((uint32_t)0x00000800)        /*!< DMA ENable managing the data input phase */
#define  AES_CR_DMAOUTEN                     ((uint32_t)0x00001000)        /*!< DMA Enable managing the data output phase */

#define  AES_CR_KSIZE                                                ((uint32_t)0x000C0000)
#define  AES_CR_KSIZE_0                                          ((uint32_t)0x00040000)
#define  AES_CR_KSIZE_1                                          ((uint32_t)0x00080000)

#define  AES_CR_FBSEL                                                ((uint32_t)0x00300000)
#define  AES_CR_FBSEL_0                                          ((uint32_t)0x00100000)
#define  AES_CR_FBSEL_1                                          ((uint32_t)0x00200000)

/*******************  Bit definition for AES_SR register  *********************/
#define  AES_SR_CCF                          ((uint32_t)0x00000001)        /*!< Computation Complete Flag */
#define  AES_SR_RDERR                        ((uint32_t)0x00000002)        /*!< Read Error Flag */
#define  AES_SR_WRERR                        ((uint32_t)0x00000004)        /*!< Write Error Flag */

/*******************  Bit definition for AES_DINR register  *******************/
#define  AES_DINR                            ((uint32_t)0xFFFFFFFF)        /*!< AES Data Input Register */

/*******************  Bit definition for AES_DOUTR register  ******************/
#define  AES_DOUTR                           ((uint32_t)0xFFFFFFFF)        /*!< AES Data Output Register */

/*******************  Bit definition for AES_KEYR0 register  ******************/
#define  AES_KEYR0                           ((uint32_t)0xFFFFFFFF)        /*!< AES Key Register 0 */

/*******************  Bit definition for AES_KEYR1 register  ******************/
#define  AES_KEYR1                           ((uint32_t)0xFFFFFFFF)        /*!< AES Key Register 1 */

/*******************  Bit definition for AES_KEYR2 register  ******************/
#define  AES_KEYR2                           ((uint32_t)0xFFFFFFFF)        /*!< AES Key Register 2 */

/*******************  Bit definition for AES_KEYR3 register  ******************/
#define  AES_KEYR3                           ((uint32_t)0xFFFFFFFF)        /*!< AES Key Register 3 */

/*******************  Bit definition for AES_IVR0 register  *******************/
#define  AES_IVR0                            ((uint32_t)0xFFFFFFFF)        /*!< AES Initialization Vector Register 0 */

/*******************  Bit definition for AES_IVR1 register  *******************/
#define  AES_IVR1                            ((uint32_t)0xFFFFFFFF)        /*!< AES Initialization Vector Register 1 */

/*******************  Bit definition for AES_IVR2 register  *******************/
#define  AES_IVR2                            ((uint32_t)0xFFFFFFFF)        /*!< AES Initialization Vector Register 2 */

/*******************  Bit definition for AES_IVR3 register  *******************/
#define  AES_IVR3                            ((uint32_t)0xFFFFFFFF)        /*!< AES Initialization Vector Register 3 */


/******************************************************************************/
/*                                                                            */
/*                Ethernet MAC Registers bits definitions                     */
/*                                                                            */
/******************************************************************************/
/* Bit definition for Ethernet MAC Control Register register */
#define ETH_MACCR_WD                                                ((uint32_t)0x00800000)  /* Watchdog disable */
#define ETH_MACCR_JD                                                ((uint32_t)0x00400000)  /* Jabber disable */
#define ETH_MACCR_IFG                                               ((uint32_t)0x000E0000)  /* Inter-frame gap */
#define ETH_MACCR_IFG_96Bit                                 ((uint32_t)0x00000000)  /* Minimum IFG between frames during transmission is 96Bit */
#define ETH_MACCR_IFG_88Bit                                 ((uint32_t)0x00020000)  /* Minimum IFG between frames during transmission is 88Bit */
#define ETH_MACCR_IFG_80Bit                                 ((uint32_t)0x00040000)  /* Minimum IFG between frames during transmission is 80Bit */
#define ETH_MACCR_IFG_72Bit                                 ((uint32_t)0x00060000)  /* Minimum IFG between frames during transmission is 72Bit */
#define ETH_MACCR_IFG_64Bit                                 ((uint32_t)0x00080000)  /* Minimum IFG between frames during transmission is 64Bit */
#define ETH_MACCR_IFG_56Bit                                 ((uint32_t)0x000A0000)  /* Minimum IFG between frames during transmission is 56Bit */
#define ETH_MACCR_IFG_48Bit                                 ((uint32_t)0x000C0000)  /* Minimum IFG between frames during transmission is 48Bit */
#define ETH_MACCR_IFG_40Bit                                 ((uint32_t)0x000E0000)  /* Minimum IFG between frames during transmission is 40Bit */
#define ETH_MACCR_CSD                                           ((uint32_t)0x00010000)  /* Carrier sense disable (during transmission) */
#define ETH_MACCR_FES                                           ((uint32_t)0x00004000)  /* Fast ethernet speed */
#define ETH_MACCR_ROD                                           ((uint32_t)0x00002000)  /* Receive own disable */
#define ETH_MACCR_LM                                            ((uint32_t)0x00001000)  /* loopback mode */
#define ETH_MACCR_DM                                            ((uint32_t)0x00000800)  /* Duplex mode */
#define ETH_MACCR_IPCO                                          ((uint32_t)0x00000400)  /* IP Checksum offload */
#define ETH_MACCR_RD                                            ((uint32_t)0x00000200)  /* Retry disable */
#define ETH_MACCR_APCS                                          ((uint32_t)0x00000080)  /* Automatic Pad/CRC stripping */
#define ETH_MACCR_BL                                            ((uint32_t)0x00000060)  /* Back-off limit: random integer number (r) of slot time delays before rescheduling
                                                                                                                                        a transmission attempt during retries after a collision: 0 =< r <2^k */
#define ETH_MACCR_BL_10                                         ((uint32_t)0x00000000)  /* k = min (n, 10) */
#define ETH_MACCR_BL_8                                          ((uint32_t)0x00000020)  /* k = min (n, 8) */
#define ETH_MACCR_BL_4                                          ((uint32_t)0x00000040)  /* k = min (n, 4) */
#define ETH_MACCR_BL_1                                          ((uint32_t)0x00000060)  /* k = min (n, 1) */
#define ETH_MACCR_DC                                            ((uint32_t)0x00000010)  /* Defferal check */
#define ETH_MACCR_TE                                            ((uint32_t)0x00000008)  /* Transmitter enable */
#define ETH_MACCR_RE                                            ((uint32_t)0x00000004)  /* Receiver enable */

