MikroElektronika/core_packages/ARM/gcc_clang/def/mindmotion/MM32F103CCT/mcu.h
#define ETH_DMABMR_RTPR                                         ((uint32_t)0x0000C000)  /* Rx Tx priority ratio */
#define ETH_DMABMR_RTPR_1_1                                 ((uint32_t)0x00000000)  /* Rx Tx priority ratio */
#define ETH_DMABMR_RTPR_2_1                                 ((uint32_t)0x00004000)  /* Rx Tx priority ratio */
#define ETH_DMABMR_RTPR_3_1                                 ((uint32_t)0x00008000)  /* Rx Tx priority ratio */
#define ETH_DMABMR_RTPR_4_1                                 ((uint32_t)0x0000C000)  /* Rx Tx priority ratio */

#define ETH_DMABMR_PBL                                          ((uint32_t)0x00003F00)  /* Programmable burst length */
#define ETH_DMABMR_PBL_1Beat                                ((uint32_t)0x00000100)  /* maximum number of beats to be transferred in one TxDMA (or both) transaction is 1 */
#define ETH_DMABMR_PBL_2Beat                                ((uint32_t)0x00000200)  /* maximum number of beats to be transferred in one TxDMA (or both) transaction is 2 */
#define ETH_DMABMR_PBL_4Beat                                ((uint32_t)0x00000400)  /* maximum number of beats to be transferred in one TxDMA (or both) transaction is 4 */
#define ETH_DMABMR_PBL_8Beat                                ((uint32_t)0x00000800)  /* maximum number of beats to be transferred in one TxDMA (or both) transaction is 8 */
#define ETH_DMABMR_PBL_16Beat                               ((uint32_t)0x00001000)  /* maximum number of beats to be transferred in one TxDMA (or both) transaction is 16 */
#define ETH_DMABMR_PBL_32Beat                               ((uint32_t)0x00002000)  /* maximum number of beats to be transferred in one TxDMA (or both) transaction is 32 */
#define ETH_DMABMR_PBL_4xPBL_4Beat                      ((uint32_t)0x01000100)  /* maximum number of beats to be transferred in one TxDMA (or both) transaction is 4 */
#define ETH_DMABMR_PBL_4xPBL_8Beat                      ((uint32_t)0x01000200)  /* maximum number of beats to be transferred in one TxDMA (or both) transaction is 8 */
#define ETH_DMABMR_PBL_4xPBL_16Beat                     ((uint32_t)0x01000400)  /* maximum number of beats to be transferred in one TxDMA (or both) transaction is 16 */
#define ETH_DMABMR_PBL_4xPBL_32Beat                     ((uint32_t)0x01000800)  /* maximum number of beats to be transferred in one TxDMA (or both) transaction is 32 */
#define ETH_DMABMR_PBL_4xPBL_64Beat                     ((uint32_t)0x01001000)  /* maximum number of beats to be transferred in one TxDMA (or both) transaction is 64 */
#define ETH_DMABMR_PBL_4xPBL_128Beat                    ((uint32_t)0x01002000)  /* maximum number of beats to be transferred in one TxDMA (or both) transaction is 128 */

#define ETH_DMABMR_EDE                                          ((uint32_t)0x00000080)  /* Enhanced Descriptor Enable */
#define ETH_DMABMR_DSL                                          ((uint32_t)0x0000007C)  /* Descriptor Skip Length */
#define ETH_DMABMR_DA                                           ((uint32_t)0x00000002)  /* DMA arbitration scheme */
#define ETH_DMABMR_SR                                           ((uint32_t)0x00000001)  /* Software reset */

/* Bit definition for Ethernet DMA Transmit Poll Demand Register */
#define ETH_DMATPDR_TPD                                         ((uint32_t)0xFFFFFFFF)  /* Transmit poll demand */

/* Bit definition for Ethernet DMA Receive Poll Demand Register */
#define ETH_DMARPDR_RPD                                         ((uint32_t)0xFFFFFFFF)  /* Receive poll demand  */

/* Bit definition for Ethernet DMA Receive Descriptor List Address Register */
#define ETH_DMARDLAR_SRL                                        ((uint32_t)0xFFFFFFFF)  /* Start of receive list */

/* Bit definition for Ethernet DMA Transmit Descriptor List Address Register */
#define ETH_DMATDLAR_STL                                        ((uint32_t)0xFFFFFFFF)  /* Start of transmit list */

/* Bit definition for Ethernet DMA Status Register */
#define ETH_DMASR_TSTS                                          ((uint32_t)0x20000000)  /* Time-stamp trigger status */
#define ETH_DMASR_PMTS                                          ((uint32_t)0x10000000)  /* PMT status */

#define ETH_DMASR_MMCS                                          ((uint32_t)0x08000000)  /* MMC status */
#define ETH_DMASR_EBS                                           ((uint32_t)0x03800000)  /* Error bits status */
/* combination with EBS[2:0] for GetFlagStatus function */
#define ETH_DMASR_EBS_DescAccess                    ((uint32_t)0x02000000)  /* Error bits 0-data buffer, 1-desc. access */
#define ETH_DMASR_EBS_ReadTransf                    ((uint32_t)0x01000000)  /* Error bits 0-write trnsf, 1-read transfr */
#define ETH_DMASR_EBS_DataTransfTx                  ((uint32_t)0x00800000)  /* Error bits 0-Rx DMA, 1-Tx DMA */

#define ETH_DMASR_TPS                                               ((uint32_t)0x00700000)  /* Transmit process state */
#define ETH_DMASR_TPS_Stopped                       ((uint32_t)0x00000000)  /* Stopped - Reset or Stop Tx Command issued  */
#define ETH_DMASR_TPS_Fetching                      ((uint32_t)0x00100000)  /* Running - fetching the Tx descriptor */
#define ETH_DMASR_TPS_Waiting                       ((uint32_t)0x00200000)  /* Running - waiting for status */
#define ETH_DMASR_TPS_Reading                       ((uint32_t)0x00300000)  /* Running - reading the data from host memory */
#define ETH_DMASR_TPS_Suspended                     ((uint32_t)0x00600000)  /* Suspended - Tx Descriptor unavailabe */
#define ETH_DMASR_TPS_Closing                       ((uint32_t)0x00700000)  /* Running - closing Rx descriptor */

#define ETH_DMASR_RPS                                       ((uint32_t)0x000E0000)  /* Receive process state */
#define ETH_DMASR_RPS_Stopped                       ((uint32_t)0x00000000)  /* Stopped - Reset or Stop Rx Command issued */
#define ETH_DMASR_RPS_Fetching                      ((uint32_t)0x00020000)  /* Running - fetching the Rx descriptor */
#define ETH_DMASR_RPS_Waiting                       ((uint32_t)0x00060000)  /* Running - waiting for packet */
#define ETH_DMASR_RPS_Suspended                     ((uint32_t)0x00080000)  /* Suspended - Rx Descriptor unavailable */
#define ETH_DMASR_RPS_Closing                       ((uint32_t)0x000A0000)  /* Running - closing descriptor */
#define ETH_DMASR_RPS_Queuing                       ((uint32_t)0x000E0000)  /* Running - queuing the recieve frame into host memory */

