MikroElektronika/core_packages/ARM/gcc_clang/def/mindmotion/MM32F103CCT/mcu.h
#define ETH_DMASR_NIS                                           ((uint32_t)0x00010000)  /* Normal interrupt summary */
#define ETH_DMASR_AIS                                           ((uint32_t)0x00008000)  /* Abnormal interrupt summary */
#define ETH_DMASR_ERS                                           ((uint32_t)0x00004000)  /* Early receive status */
#define ETH_DMASR_FBES                                          ((uint32_t)0x00002000)  /* Fatal bus error status */
#define ETH_DMASR_ETS                                           ((uint32_t)0x00000400)  /* Early transmit status */
#define ETH_DMASR_RWTS                                          ((uint32_t)0x00000200)  /* Receive watchdog timeout status */
#define ETH_DMASR_RPSS                                          ((uint32_t)0x00000100)  /* Receive process stopped status */
#define ETH_DMASR_RBUS                                          ((uint32_t)0x00000080)  /* Receive buffer unavailable status */
#define ETH_DMASR_RS                                            ((uint32_t)0x00000040)  /* Receive status */
#define ETH_DMASR_TUS                                           ((uint32_t)0x00000020)  /* Transmit underflow status */
#define ETH_DMASR_ROS                                           ((uint32_t)0x00000010)  /* Receive overflow status */
#define ETH_DMASR_TJTS                                          ((uint32_t)0x00000008)  /* Transmit jabber timeout status */
#define ETH_DMASR_TBUS                                          ((uint32_t)0x00000004)  /* Transmit buffer unavailable status */
#define ETH_DMASR_TPSS                                          ((uint32_t)0x00000002)  /* Transmit process stopped status */
#define ETH_DMASR_TS                                            ((uint32_t)0x00000001)  /* Transmit status */

/* Bit definition for Ethernet DMA Operation Mode Register */
#define ETH_DMAOMR_DTCEFD                                       ((uint32_t)0x04000000)  /* Disable Dropping of TCP/IP checksum error frames */
#define ETH_DMAOMR_RSF                                          ((uint32_t)0x02000000)  /* Receive store and forward */
#define ETH_DMAOMR_DFRF                                         ((uint32_t)0x01000000)  /* Disable flushing of received frames */
#define ETH_DMAOMR_TSF                                          ((uint32_t)0x00200000)  /* Transmit store and forward */
#define ETH_DMAOMR_FTF                                          ((uint32_t)0x00100000)  /* Flush transmit FIFO */
#define ETH_DMAOMR_TTC                                          ((uint32_t)0x0001C000)  /* Transmit threshold control */
#define ETH_DMAOMR_TTC_64Bytes                          ((uint32_t)0x00000000)  /* threshold level of the MTL Transmit FIFO is 64 Bytes */
#define ETH_DMAOMR_TTC_128Bytes                         ((uint32_t)0x00004000)  /* threshold level of the MTL Transmit FIFO is 128 Bytes */
#define ETH_DMAOMR_TTC_192Bytes                         ((uint32_t)0x00008000)  /* threshold level of the MTL Transmit FIFO is 192 Bytes */
#define ETH_DMAOMR_TTC_256Bytes                         ((uint32_t)0x0000C000)  /* threshold level of the MTL Transmit FIFO is 256 Bytes */
#define ETH_DMAOMR_TTC_40Bytes                          ((uint32_t)0x00010000)  /* threshold level of the MTL Transmit FIFO is 40 Bytes */
#define ETH_DMAOMR_TTC_32Bytes                          ((uint32_t)0x00014000)  /* threshold level of the MTL Transmit FIFO is 32 Bytes */
#define ETH_DMAOMR_TTC_24Bytes                          ((uint32_t)0x00018000)  /* threshold level of the MTL Transmit FIFO is 24 Bytes */
#define ETH_DMAOMR_TTC_16Bytes                          ((uint32_t)0x0001C000)  /* threshold level of the MTL Transmit FIFO is 16 Bytes */
#define ETH_DMAOMR_ST                                           ((uint32_t)0x00002000)  /* Start/stop transmission command */
#define ETH_DMAOMR_FEF                                          ((uint32_t)0x00000080)  /* Forward error frames */
#define ETH_DMAOMR_FUGF                                         ((uint32_t)0x00000040)  /* Forward undersized good frames */
#define ETH_DMAOMR_RTC                                          ((uint32_t)0x00000018)  /* receive threshold control */
#define ETH_DMAOMR_RTC_64Bytes                          ((uint32_t)0x00000000)  /* threshold level of the MTL Receive FIFO is 64 Bytes */
#define ETH_DMAOMR_RTC_32Bytes                          ((uint32_t)0x00000008)  /* threshold level of the MTL Receive FIFO is 32 Bytes */
#define ETH_DMAOMR_RTC_96Bytes                          ((uint32_t)0x00000010)  /* threshold level of the MTL Receive FIFO is 96 Bytes */
#define ETH_DMAOMR_RTC_128Bytes                         ((uint32_t)0x00000018)  /* threshold level of the MTL Receive FIFO is 128 Bytes */
#define ETH_DMAOMR_OSF                                          ((uint32_t)0x00000004)  /* operate on second frame */
#define ETH_DMAOMR_SR                                           ((uint32_t)0x00000002)  /* Start/stop receive */

/* Bit definition for Ethernet DMA Interrupt Enable Register */
#define ETH_DMAIER_NISE                                         ((uint32_t)0x00010000)  /* Normal interrupt summary enable */
#define ETH_DMAIER_AISE                                         ((uint32_t)0x00008000)  /* Abnormal interrupt summary enable */
#define ETH_DMAIER_ERIE                                         ((uint32_t)0x00004000)  /* Early receive interrupt enable */
#define ETH_DMAIER_FBEIE                                        ((uint32_t)0x00002000)  /* Fatal bus error interrupt enable */
#define ETH_DMAIER_ETIE                                         ((uint32_t)0x00000400)  /* Early transmit interrupt enable */
#define ETH_DMAIER_RWTIE                                        ((uint32_t)0x00000200)  /* Receive watchdog timeout interrupt enable */
#define ETH_DMAIER_RPSIE                                        ((uint32_t)0x00000100)  /* Receive process stopped interrupt enable */
#define ETH_DMAIER_RBUIE                                        ((uint32_t)0x00000080)  /* Receive buffer unavailable interrupt enable */
#define ETH_DMAIER_RIE                                          ((uint32_t)0x00000040)  /* Receive interrupt enable */
#define ETH_DMAIER_TUIE                                         ((uint32_t)0x00000020)  /* Transmit Underflow interrupt enable */
#define ETH_DMAIER_ROIE                                         ((uint32_t)0x00000010)  /* Receive Overflow interrupt enable */
#define ETH_DMAIER_TJTIE                                        ((uint32_t)0x00000008)  /* Transmit jabber timeout interrupt enable */
#define ETH_DMAIER_TBUIE                                        ((uint32_t)0x00000004)  /* Transmit buffer unavailable interrupt enable */
#define ETH_DMAIER_TPSIE                                        ((uint32_t)0x00000002)  /* Transmit process stopped interrupt enable */
#define ETH_DMAIER_TIE                                          ((uint32_t)0x00000001)  /* Transmit interrupt enable */

/* Bit definition for Ethernet DMA Missed Frame and Buffer Overflow Counter Register */
#define ETH_DMAMFBOCR_OFOC                                      ((uint32_t)0x10000000)  /* Overflow bit for FIFO overflow counter */
#define ETH_DMAMFBOCR_MFA                                       ((uint32_t)0x0FFE0000)  /* Number of frames missed by the application */
#define ETH_DMAMFBOCR_OMFC                                      ((uint32_t)0x00010000)  /* Overflow bit for missed frame counter */
#define ETH_DMAMFBOCR_MFC                                       ((uint32_t)0x0000FFFF)  /* Number of frames missed by the controller */

/* Bit definition for Ethernet DMA Current Host Transmit Descriptor Register */
#define ETH_DMACHTDR_HTDAP                                      ((uint32_t)0xFFFFFFFF)  /* Host transmit descriptor address pointer */

